SM_для_EDT/src/Catalogs/vftТиповыеОперации/vftТиповыеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>vftТиповыеОперации</name>
  <predefined>
    <items>
      <name>Бункеровка</name>
      <description>Бункеровка (Л)</description>
    </items>
    <items>
      <name>Выгрузка</name>
      <description>Выгрузка (Ж)</description>
    </items>
    <items>
      <name>ПаузкаДогрузка</name>
      <description>Догрузка</description>
    </items>
    <items>
      <name>Маневры</name>
      <description>Маневры в пункте</description>
    </items>
    <items>
      <name>МаневрыНаПереходе</name>
      <description>Маневры на переходе - КВК, СПБ (З)</description>
    </items>
    <items>
      <name>МетеорологическиеПричины</name>
      <description>Метеорологические причины (И)</description>
    </items>
    <items>
      <name>НачалоРейса</name>
      <description>Начало рейса</description>
    </items>
    <items>
      <name>ОжиданиеВыгрузки</name>
      <description>Ожидание выгрузки (Д)</description>
    </items>
    <items>
      <name>ОжиданиеДогрузки</name>
      <description>Ожидание догрузки</description>
    </items>
    <items>
      <name>ФормированиеСостава</name>
      <description>Ожидание и формирование состава</description>
    </items>
    <items>
      <name>ОжиданиеОформленияОтхода</name>
      <description>Ожидание оформления отхода (Н)</description>
    </items>
    <items>
      <name>ОжиданиеОформленияПрихода</name>
      <description>Ожидание оформления прихода (Н)</description>
    </items>
    <items>
      <name>ОжиданиеПаузки</name>
      <description>Ожидание паузки (С)</description>
    </items>
    <items>
      <name>ОжиданиеПогрузки</name>
      <description>Ожидание погрузки (Д)</description>
    </items>
    <items>
      <name>ОжиданиеРазводкиМостов</name>
      <description>Ожидание разводки мостов</description>
    </items>
    <items>
      <name>РазрешениеНаДвижение</name>
      <description>Ожидание разрешения на движение (Р)</description>
    </items>
    <items>
      <name>ОжиданиеЭкипажа</name>
      <description>Ожидание экипажа (М)</description>
    </items>
    <items>
      <name>ПаузкаВыгрузка</name>
      <description>Паузка (Т)</description>
    </items>
    <items>
      <name>Перевалка</name>
      <description>Перевалка (Е)</description>
    </items>
    <items>
      <name>ПередачаТоплива</name>
      <description>Передача топлива (Л)</description>
    </items>
    <items>
      <name>Погрузка</name>
      <description>Погрузка (Е)</description>
    </items>
    <items>
      <name>ПромежуточныйПункт</name>
      <description>Промежуточный пункт</description>
    </items>
    <items>
      <name>Ремонт</name>
      <description>Ремонт (К)</description>
    </items>
    <items>
      <name>Шлюзование</name>
      <description>Шлюзование</description>
    </items>
  </predefined>
  <attributes>
    <name>Стоянка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимаСтоянка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьПослеСтоянки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧистыеГрузовыеОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаОтчета</name>
    <type>
      <types>EnumRef.vftГруппыСтоянокПутевогоЖурнала</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьВПутевомЖурнале</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТолькоСАналитикой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВРДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияДляРДО</name>
    <type>
      <types>CatalogRef.vftТиповыеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РазделениеПоМоделямРДО</name>
    <attributes>
      <name>МодельРДО</name>
      <type>
        <types>CatalogRef.впМодельРДО</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидимостьВПЖ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидимостьВРДО</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/vftТиповыеОперации/ManagerModule.bsl
// ++ rarus Чернавин Г.К 17.03.2020
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция МанервыИлиОжидание(Параметр) Экспорт
	
	Если Параметр = Справочники.vftТиповыеОперации.Маневры Тогда
		Возврат Истина;
	ИначеЕсли Параметр = Справочники.vftТиповыеОперации.МаневрыНаПереходе Тогда
		Возврат Истина;
	ИначеЕсли Параметр = Справочники.vftТиповыеОперации.ФормированиеСостава Тогда
		Возврат Истина;
	ИначеЕсли Параметр = Справочники.vftТиповыеОперации.ОжиданиеПогрузки Тогда
		Возврат Истина;
	ИначеЕсли Параметр = Справочники.vftТиповыеОперации.ОжиданиеВыгрузки Тогда
		Возврат Истина;
	ИначеЕсли Параметр = Справочники.vftТиповыеОперации.ОжиданиеПаузки Тогда
		Возврат Истина;
	ИначеЕсли Параметр = Справочники.vftТиповыеОперации.ОжиданиеДогрузки Тогда
		Возврат Истина;
	ИначеЕсли Параметр = Справочники.vftТиповыеОперации.НачалоРейса Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
#КонецЕсли
// -- rarus Чернавин Г.К 17.03.2020

// ++ rarus Камаев П.В. 25.01.2021
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("Наименование");
	Поля.Добавить("КодОперации");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	ОсновноеСудно	= vftОбщегоНазначения.ПолучитьЗначениеПоУмолчанию("ОсновноеСудно");
	ЭтоСудноМСГФ	= рарусОбщегоНазначенияВызовСервера.ЭтоСудноМСГФ(ОсновноеСудно);
	
	Если ЗначениеЗаполнено(Данные.КодОперации) И ЭтоСудноМСГФ Тогда
		Представление = Данные.КодОперации + " (" + Данные.Наименование + ")";
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры
// -- rarus Камаев П.В. 25.01.2021
